# data-database-types-relational-language-SQL-MySQL-function-built-in-control-flow-conditional
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- control flow - **function** - **IF** - **tests** a - **condition** - if the **condition** - **True** - **value_if_true** - **returned** - if the **condition** - **False** - **value_if_false** - **returned** [1]

```sql
IF(conidition,value_if_true,value_if_false)
```

- condition  - test - 150 is greater than 200 - False - alias - Y/N [1]

```sql
mysql> SELECT IF(150>200,"Yes","No") as "Y/N";
+-----+
| Y/N |
+-----+
| No  |
+-----+
1 row in set (0.00 sec)
```

```sql
mysql> use school;
Database changed
```

```sql
mysql> show tables;
+------------------+
| Tables_in_school |
+------------------+
| subject          |
| teacher          |
+------------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM teacher;
+-----+--------------+-------+------------+------------+
| tid | Name         | level | experience | dob        |
+-----+--------------+-------+------------+------------+
|   1 | Mr. Pasteur  | L     |         15 | 1960-02-02 |
|   2 | Ms. Dubois   | L     |         22 | 1967-09-02 |
|   3 | Ms. Smith    | J     |          4 | 1980-03-23 |
|   4 | Mr. Hawking  | L     |         40 | 1951-02-19 |
|   5 | Mr. Kavanagh | J     |         50 | 1949-11-01 |
|   6 | Mr. Picasso  | J     |         42 | 1939-03-30 |
|   7 | Fr. Lynch    | L     |         55 | 1939-03-31 |
+-----+--------------+-------+------------+------------+
7 rows in set (0.00 sec)
```

- query - report all teachers details - additional column - attribute - field - alias - Payrise Due - indicating if due a pay rise - condition - teacher experience is between twenty and forty-five years - due a pay rise - note the column - attribute - field - Payrise Due - is just a new column - attribute - field - in the result query table - original table - entity - relation - teacher - unaffected [1]

```sql
mysql> SELECT *,
    -> IF(experience>=20 AND experience<=45,"Y","") AS "Payrise Due"
    -> FROM teacher;
+-----+--------------+-------+------------+------------+-------------+
| tid | Name         | level | experience | dob        | Payrise Due |
+-----+--------------+-------+------------+------------+-------------+
|   1 | Mr. Pasteur  | L     |         15 | 1960-02-02 |             |
|   2 | Ms. Dubois   | L     |         22 | 1967-09-02 | Y           |
|   3 | Ms. Smith    | J     |          4 | 1980-03-23 |             |
|   4 | Mr. Hawking  | L     |         40 | 1951-02-19 | Y           |
|   5 | Mr. Kavanagh | J     |         50 | 1949-11-01 |             |
|   6 | Mr. Picasso  | J     |         42 | 1939-03-30 | Y           |
|   7 | Fr. Lynch    | L     |         55 | 1939-03-31 |             |
+-----+--------------+-------+------------+------------+-------------+
7 rows in set (0.00 sec)
```

***
# END